config.org
#+title: black emacs 🐉
#+author: marcelo machado <uniqueduckinbox@duck.com>

* first steps

- install emacs >=29.4
- create =~/.emacs.d/init.el=
- create =~/.emacs.d/config.org=

** =init.el= content

#+begin_example emacs-lisp
  (org-babel-load-file
   (expand-file-name "config.org" user-emacs-directory))  
#+end_example

* general configurations

** TODO - REMOVE
#+begin_src emacs-lisp
(load-theme 'modus-vivendi)
(org-indent-mode t)
#+end_src

** disable startup configurations
#+begin_src emacs-lisp
    (setq
     inhibit-startup-message t
     inhibit-default-init t
     inhibit-splash-screen t
     inhibit-startup-screen t
     inhibit-startup-buffer-menu t
     frame-inhibit-implied-size t
     inhibit-startup-echo-area-message user-login-name)
#+end_src

** gui configuration
#+begin_src emacs-lisp
  (push '(fullscreen . maximized) initial-frame-alist)
  (push '(fullscreen . maximized) default-frame-alist)
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)
  (column-number-mode 1)
  (save-place-mode 1)
  (recentf-mode 1)
  (savehist-mode 1)
  (global-display-line-numbers-mode t)
  (global-hl-line-mode t)
#+end_src

** sanity configurations
#+begin_src emacs-lisp
  (setq visible-bell nil)
  (global-unset-key (kbd "C-z"))
  (delete-selection-mode t)
#+end_src

* package manager configurations

** package
#+begin_src emacs-lisp
    (require 'package)
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                             ("elpa" . "https://elpa.gnu.org/packages/")))
    (package-initialize)
    (unless package-archive-contents
      (package-refresh-contents))
#+end_src

** use-package configuration
#+begin_src emacs-listp
(unless (package-installed-p 'use-package)
(package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* packages
